artillery-load-test.yml
config:
  target: http://localhost:3000
  http:
    timeout: 100000
    maxKeepAliveRequests: 100000
    maxKeepAliveTime: 100000
  phases:
    - duration: 60
      arrivalRate: 20
  variables:
    environment: "test"
  defaults:
    headers:
      Content-Type: application/json
      User-Agent: "Artillery"
scenarios:
  - name: "Envio de projeto"
    flow:
      - log: "Current environment is set to: {{ environment }}"
      - post:
          url: "/"
          json:
            text: "Um projeto de combate aos maus tratos animais. um projeto que ajude as pessoas a denunciar maus tratos"